blog/2020/08/yesterday-you-said-tomorrow/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-09 Sat 18:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Yesterday, You Said Tomorrow</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="Sharing Work in Progress"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.devnulllabs.io"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://twitter.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-twitter fa-1x"></i>
  </a>
  <a href="https://www.buymeacoffee.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-mug-hot fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/932F3E8E1C0F4A9895D7B8B8B0CAA28A02958308.txt"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">Yesterday, You Said Tomorrow</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbf5f79d">Inspiration and Conflicts</a>
<ul>
<li><a href="#org95a2932">Going Write Only</a></li>
<li><a href="#org7a13c42">Makers vs Managers</a></li>
<li><a href="#org47a4a1b">Deep Work</a></li>
<li><a href="#org61d3d97">(Laboratory) Notebook Skills</a></li>
<li><a href="#org6610f15">Show Your Work</a></li>
</ul>
</li>
<li><a href="#org5d3ed01">Confluence and Insolubility</a></li>
<li><a href="#orgea50ea4">Challenges and Commitments</a></li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
<a href="https://www.youtube.com/watch?v=iAg4yMangmY">"Yesterday, you said tomorrow."</a>  Entering the first week of being a full-time
graduate assistant, I want to start a more earnest attempt to share more of the
experience and the journey.  I've always maintained that the journey itself is
the worthier part, the ends only a different way to spell "beginning".
</p>

</div>

<p>
Any time I internally commit to doing something, I remember the mildly
ridiculous quote from <a href="https://www.youtube.com/watch?v=iAg4yMangmY">Shia LaBeouf's GreenScreen recording</a> "Yesterday, you said
tomorrow".  Yesterday, I said tomorrow I would write this post.  Today is now
tomorrow and here goes.
</p>

<p>
I am starting my transition from a full-time software developer/site
reliability engineer to being a full-time graduate assistant, working towards a
PhD.  This post is a first in a series of posts where I will attempt to share
my research; technical tangents that come along the way; my thoughts and
inspirations; and likely many other random topics in between.  It's my
intention to write and share these fairly regularly.  Of course, we'll see how
the energy maintains through the weeks.
</p>

<div id="outline-container-orgbf5f79d" class="outline-2">
<h2 id="orgbf5f79d"><a id="ID-6a741000-6b5f-46e6-86bc-6c1e889a1d9c"></a>Inspiration and Conflicts</h2>
<div class="outline-text-2" id="text-orgbf5f79d">
<p>
Let's traverse the path that planted the seed of this post, where it originally
came from and where it is now.  Finally, there's a bit of a dilemma to be posed
that I am not completely certain of the answer.
</p>

<blockquote>
<p>
A lot can be said about each of the below.  In introducing them, my summaries
likely will not give justice to each.  There's a lot to unpack in each of these
and the connections may not be as obvious as I claim.  I certainly wish I had
the time or space to clearly delineate the various connections of points.
Instead, I encourage the deep dive into each; perhaps a different and
contradictory conclusion will be reached!
</p>
</blockquote>
</div>

<div id="outline-container-org95a2932" class="outline-3">
<h3 id="org95a2932"><a id="ID-d7a61189-bd44-43fc-84f0-3af13acdbdd2"></a>Going Write Only</h3>
<div class="outline-text-3" id="text-org95a2932">
<p>
Back in 2015, <a href="https://begriffs.com/posts/2015-04-20-going-write-only.html">Joe Nelson posted "Going Write Only"</a>.  I was only just starting
to write blog posts, but I certainly didn't write with any particular
frequency.  "Going Write Only" was certainly inspiring, but I didn't have the
material nor the confidence to share and write that frequently, let alone make
a public commitment to that end.
</p>

<p>
The thesis of the going "write only" resonated, however, since I had similar
problems of consumption only, being in a state of "read only": go to work, read
HackerNews, check emails, wait, when did it become lunch time?  I clearly
couldn't articulate my frustration nor had the thought of breaking the cycle
and going write only fully awaken within me.
</p>
</div>
</div>

<div id="outline-container-org7a13c42" class="outline-3">
<h3 id="org7a13c42"><a id="ID-82fd574a-ac36-4de1-8961-441e676f08bf"></a>Makers vs Managers</h3>
<div class="outline-text-3" id="text-org7a13c42">
<p>
Around this time, 2016, I stumbled into <a href="http://paulgraham.com/makersschedule.html">Paul Graham's "Maker's Schedules vs
Manager's Schedules"</a> post.  At the time of reading, I was poorly balancing both
schedules as a lead developer of a small team.  Issue triage and team
coordination consuming all remaining vestiges of my maker time, I immediately
connected with the principle of the article.
</p>

<p>
However, I failed in attempting any version of execution of the idea.  I never
had the clout or the gravitas to effectively move meetings to one side of the
day.  This has continued to be a struggle of mine as I have moved to different
roles in different companies.
</p>
</div>
</div>

<div id="outline-container-org47a4a1b" class="outline-3">
<h3 id="org47a4a1b"><a id="ID-a2218724-9a1c-438f-9f19-ff8978ab9752"></a>Deep Work</h3>
<div class="outline-text-3" id="text-org47a4a1b">
<p>
Several years ago, approximately 2017, a friend and colleague of mine
recommended <a href="https://www.calnewport.com/books/deep-work/">Cal Newport's "Deep Work"</a> to me.  I ate it up and again recommended
it to anyone who would listen.  The arguments against social media and other
distractions in life rang true with my own experience.  Being on top of emails
and other forms of communication already seemed wrong; how can we be deep in
thought <span class="underline">and</span> be deeply connected to the various conversations that we might be
participating.  Newport's thesis and my own experience would both answer this
question with unequivocal "no".  Modality of tasks seems to be a more healthy
and appropriate model of working.  Work deeply without distraction, focus the
limited energy to the problem at hand.
</p>
</div>
</div>

<div id="outline-container-org61d3d97" class="outline-3">
<h3 id="org61d3d97"><a id="ID-37a50eaa-5f9c-43f6-9d4f-677eb22ac838"></a>(Laboratory) Notebook Skills</h3>
<div class="outline-text-3" id="text-org61d3d97">
<p>
The earliest reference I can find, <a href="https://www.dur.ac.uk/resources/physics/students/labs/skills/notebookskills.pdf">Notebook Skills</a> was posted to <a href="https://news.ycombinator.com/item?id=15052384">HackerNews</a>
in 2017.  Dutifully keeping a log of work, notes, results, thoughts would be
helpful in the likely event of context switches.  Being able to review these
notes to reintegrate into the flow would be invaluable.  How many times have I
been stuck on a problem feeling aimless in my approach, not sure where I left
off, unsure what changes were made, when, why they worked, or why they did not?
</p>

<p>
Switching to <a href="https://www.gnu.org/software/emacs">Emacs</a> and starting to leverage <a href="https://orgmode.org">Org Mode</a> as much as possible, these
skills seemed like a very natural extension.
</p>

<p>
However, I have certainly failed at maintaining this habit.  Our patterns and
behaviours are dramatically influenced by the amount of friction involved.
</p>
</div>
</div>

<div id="outline-container-org6610f15" class="outline-3">
<h3 id="org6610f15"><a id="ID-d62e9a24-dc8f-48e5-8c96-f267b5ddd0a8"></a>Show Your Work</h3>
<div class="outline-text-3" id="text-org6610f15">
<p>
Recently, another colleague loaned me a copy of <a href="https://austinkleon.com/steal/">Austin Kleon's "Steal Like an
Arist"</a>.  A very short book that describes and enumerates steps for investing in
your own craft.  The craft itself is not material to the discussion, the
content can be lifted to any creative endeavor without too much mental
gymnastics.
</p>

<p>
I was caught by the idea of sharing the work, even if it's not complete.
</p>

<p>
The next book in the series started by <a href="https://austinkleon.com/steal/">"Steal Like an Artist"</a> is <a href="https://austinkleon.com/show-your-work/">"Show Your
Work"</a>.  Naturally, I'm working my way through it (even convinced my colleague
whom recommended the first book to purchase the second book).  But for the past
week or so, I've been stuck thinking about "daily dispatches", posting a blog,
a tweet, an email, really anything that someone&#x2013; anyone&#x2013; may be interested
in.  Sharing the progress, snapshots of the creators mind or the project itself
if possible.  Again, the journey and experience is the worthier part.
</p>
</div>
</div>
</div>


<div id="outline-container-org5d3ed01" class="outline-2">
<h2 id="org5d3ed01"><a id="ID-283f3968-78ff-4ed9-92d7-d9b25e11ebac"></a>Confluence and Insolubility</h2>
<div class="outline-text-2" id="text-org5d3ed01">
<p>
Most of these articles dovetail or otherwise co-relate to each other in fairly
obvious and intuitive ways.  It's pretty easy to see parallels and connections
between <a href="https://begriffs.com/posts/2015-04-20-going-write-only.html">"Going Write Only"</a>, <a href="https://www.dur.ac.uk/resources/physics/students/labs/skills/notebookskills.pdf">Notebook Skills</a>, and <a href="https://austinkleon.com/show-your-work/">"Show Your Work"</a>.  It's fairly
easy to draw connections between <a href="https://www.calnewport.com/books/deep-work/">"Deep Work"</a> and <a href="http://paulgraham.com/makersschedule.html">"Makers Schedules vs Managers
Schedules"</a>.  Conversely, however, it's much less obvious to see the connection
between the former set of articles to the latter set.
</p>

<p>
Clearly, deep work is a necessary ingredient to creating.  It's less clear that
sharing the work in progress is a necessary component to making great work.
How to integrate these two ideas and philosophies has been the underlying root
of this post some weeks ago, the issue that begs for resolution.
</p>

<p>
The only answer that seems to hold water for me is this: by sharing the work in
progress, by forcing its digestion into something consumable to others helps
(re)organize the information; the information is more thoroughly understood and
accessible in our own brain as a result.  The final summit of acquiring
knowledge is to teach the knowledge gained.
</p>
</div>
</div>

<div id="outline-container-orgea50ea4" class="outline-2">
<h2 id="orgea50ea4"><a id="ID-0105c63f-e64d-4d7f-946a-19dcaf2591df"></a>Challenges and Commitments</h2>
<div class="outline-text-2" id="text-orgea50ea4">
<p>
As this new chapter opens, I want to make the commitment of going "write only";
the commitment to become a disciple of deep work; the commitment of keeping
good notes; and the commitment of sharing the process, the knowledge, the
tangents, and the thoughts along the journey.
</p>

<p>
Certainly, here be dragons.  There are many challenges to overcome.  How best
to manage and appropriate time for reading, developing, and writing (not to
mention other obligations that don't fit the scope here)?  How to maintain
balance and energy in the pursuit of the commitments and ultimate goals?  How
to overcome personal qualities that inhibit and scream out against everything
here?
</p>

<p>
These are not insurmountable hurdles, <a href="https://www.youtube.com/watch?v=iAg4yMangmY">"Nothing is impossible"</a>.  Through
dedicated and concerted, these challenges can become merely small obstacles
which can be easily stepped over.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2022 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
